{"@type":"Recipe",
"@context":"http://schema.org/",
"headline":"Pumpkin Pie",
"keywords":"pumpkin pie",
"recipeCategory":"Dessert",
"url": "https://www.bettycrocker.com/recipes/pumpkin-pie/c20c218d-9d63-4f1c-aee3-0a93381e2f0d",
"publisher": {"name": "Betty Crocker"},
"image":"https://images-gmi-pmc.edge-generalmills.com/88e568ed-80f2-4bea-974c-ecf06ef632fb.jpg",
"description":"When it comes to Thanksgiving, our eyes go right to the dessert table, searching for homemade Pumpkin Pie. With a flaky crust, smooth pumpkin filling and sweetened whipped cream, what's not to love about Pumpkin Pie? This is the best Pumpkin Pie recipe we've ever made, thanks to its incredible flavor profile and simple instructions. If there are leftovers–which are usually hard to come by–we'll even have Pumpkin Pie for breakfast!",
"recipeIngredient":["1 1/3  cups Gold Medal™ all-purpose flour","1/2  teaspoon salt","1/3  cup vegetable oil","2  tablespoons cold water","2  eggs","1/2  cup sugar","1  teaspoon ground cinnamon","1/2  teaspoon salt","1/2  teaspoon ground ginger","1/8  teaspoon ground cloves","1  can (15 oz) pumpkin (not pumpkin pie mix)","1  can (12 oz) evaporated milk","3/4  cup whipping cream","2  tablespoons sugar"],
"totalTime":"PT3H20M",
"prepTime":"PT0H20M",
"recipeYield":"8",
"aggregateRating":{"@type":"AggregateRating","ratingValue":"4.5","ratingCount":"126","bestRating":"5","worstRating":"1"},"video":{"@type":"VideoObject","name":"How to Make Pumpkin Pie Video","thumbnailUrl":"https://images-gmi-pmc.edge-generalmills.com/e36797d9-ed74-49fb-aced-5359b80104fa.jpg","description":"When it comes to setting the table for Thanksgiving, wed argue that pumpkin pie is the most important thing on the table. (We are dessert people, after allwed skip dinner if it meant we could get straight to the pie.) This is one of our most traditional pumpkin pie recipes, made totally from scratch with all the creamy, spiced goodness you and your family can handle. Because pumpkin pie filling is essentially a custard, make sure you use a regular 9-inch pie plate rather than substituting a deeper dish. The shallower pan ensures that you can press the crust up the sides far enough so the filling stays inside the pie and doesnt run over the rim. If youre looking for a twist on tradition, you may want to check out our Pumpkin Pie Sugar Cookies that look like mini pies (perfect for more of a bite-sized dessert spread!) or Pumpkin-Cream Cheese Pie, which is swirled with a tangy cream cheese mixture. Or if youre one of those people who thinks pie crust just gets in the way of the filling, this crustless Impossibly Easy Pumpkin Pie is the one for youthe secret ingredient is  Original Bisquick mix!","contentUrl":"https://www.bettycrocker.com/videos/pumpkin-pie","embedUrl":"https://www.youtube.com/embed/7zovTOZUfTI","uploadDate":"09/17/2018"},"author":{"@type":"Person","name":"Betty Crocker Kitchens"},
"recipeInstructions":[{"@type":"HowToStep","text":"Heat oven to 425°F. In medium bowl, mix flour, 1/2 teaspoon salt and the oil with fork until all flour is moistened. Sprinkle with cold water, 1 tablespoon at a time, tossing with fork until all water is absorbed. Shape pastry into a ball. Press in bottom and up side of 9-inch glass pie plate."},{"@type":"HowToStep","text":"In large bowl, beat eggs slightly with wire whisk or hand beater. Beat in 1/2 cup sugar, the cinnamon, 1/2 teaspoon salt, ginger, cloves, pumpkin and milk. "},{"@type":"HowToStep","text":"To prevent spilling, place pastry-lined pie plate on oven rack before adding filling. Carefully pour pumpkin filling into pie plate. Bake 15 minutes. "},
    {"@type":"HowToStep","text":"Reduce oven temperature to 350°F. Bake about 45 minutes longer or until knife inserted in center comes out clean. Place pie on cooling rack. Cool completely, about 2 hours. "},{
        "@type":"HowToStep","text":"In chilled medium bowl, beat whipping cream and 2 tablespoons sugar with electric mixer on high speed until stiff peaks form. Serve pie with  whipped cream. Store in refrigerator. "}],
"nutrition":{"@type":"NutritionInformation","calories":"185  ","carbohydrateContent":"37  g","cholesterolContent":"5  mg","fiberContent":"2  g","proteinContent":"7  g","saturatedFatContent":"1  g","servingSize":"1 Serving","sodiumContent":"170  mg"},"dateCreated":"01/01/2004"}